app/Http/Controllers/V1/AlumnoAPIController.php

    public function index() {
        return Alumno::get();
---
select * from `alumnos`

    public function show($id) {
        //Buscar el alumno
        $alumno = Alumno::find($id);
---
select * from `alumnos` where `alumnos`.`id` = '3' limit 1

    public function store(Request $request) {
        //Validamos los datos
        $datos = $request->only('nombre','apellido','email','edad','direccion','foto');

        $validator = Validator::make($datos,[
            'nombre' => 'required|string|max:250',
            'apellido' => 'required|string|max:250',
            'email' => 'required|email',
            'edad' => 'required|int|min:0|max:150',
            'direccion' => 'required|string|max:250',
            'foto' => 'required|max:20480000|mimes:jpeg,png,jpg'
        ]);

        //Si falla la validacion
        if($validator->fails()) {
            return response()->json(['error' => $validator->messages()],400);
        }

        //Creamos el alumno en la Base de datos
        $alumno = Alumno::create([
            'nombre' => $request->nombre,
            'apellido' => $request->apellido,
            'email' => $request->email,
            'edad' => $request->edad,
            'direccion' => $request->direccion,
            'foto' => $request->file('foto')->store('uploads','public'),
        ]);
---
insert into `alumnos` (`nombre`, `apellido`, `email`, `edad`, `direccion`, `foto`, `updated_at`, `created_at`) values ('Antonio Jesus', 'Fernandez Molina', 'antonio.fernandez@escuelaestech.es', '21', 'Prior Pellon 5', 'uploads/DclhR420lW8dimLxmy4ZaJTnZKMJSh7UNCHIMdr8.png', '2023-02-24 17:19:51', '2023-02-24 17:19:51')

    public function update(Request $request, $id) {
        //Validar los datos
        $datos = $request->only('nombre','apellido','email','edad','direccion','foto');
        $validator = Validator::make($datos,[
            'nombre' => 'required|string|max:250',
            'apellido' => 'required|string|max:250',
            'email' => 'required|email',
            'edad' => 'required|int|min:0|max:150',
            'direccion' => 'required|string|max:250',
            'foto' => 'max:20480000|mimes:jpeg,png,jpg'
        ]);

        //Si falla la validacion
        if($validator->fails()) {
            return response()->json(['error' => $validator->messages()],400);
        }

        //Buscamos la id del alumno
        $alumno = Alumno::find($id);
---
select * from `alumnos` where `alumnos`.`id` = '3' limit 1

            }
        }

        $alumno->update($datos);
---
update `alumnos` set `nombre` = 'Antonio Jesus', `edad` = '25', `direccion` = 'Prior Pellon 5', `alumnos`.`updated_at` = '2023-02-24 18:16:05' where `id` = 3