app/Http/Controllers/V1/AuthController.php

    public function register(Request $request) {
        //Pasamos los parametros
        $data = $request->only('name','email','password');
        //Hacemos la validacion
        $validator = Validator::make($data, [
            'name' => 'required|string',
            'email' => 'required|email|unique:users',
            'password' => 'required|string|min:6|max:50',
        ]);

        //Devolvemos un error si falla la validacion
        if($validator->fails()) {
            return response()->json(['error' => $validator->messages()], 400);
        }

        //Creamos el usuario registrado
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => bcrypt($request->password), //bcrypt funcion que encripta cosas en este caso la contraseña
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Antonio', 'pepeluis25@gmail.com', '$2y$10$XmKJbNs/emGN1dWeMiHllOBirKrF6m/hGlJRXX9h1ktyXMk/qb.du', '2023-02-23 19:43:44', '2023-02-23 19:43:44')