app/Http/Controllers/AlumnoController.php

select * from `alumnos` limit 5 offset 0
select count(*) as aggregate from `alumnos`
---
    public function index() {
        //$datos['alumnos'] = Alumno::all(); Esto nos envia a la vista los datos de la base de datos
        $edad = 22;
        // $datos['alumnos'] = DB::select('select * from alumnos where edad > ?', [$edad]);
        $datos['alumnos'] = Alumno::paginate(5);